In [1]:
import pandas as pd
import numpy as np

In [7]:
def my_sq(x):
    return x**2

In [10]:
def my_exp(x, n):
    return x**n

In [3]:
df = pd.DataFrame({'a': [10,20,30], 'b':[20,30,40]})
print(df)

    a   b
0  10  20
1  20  30
2  30  40

In [5]:
print(df['a']**2)

0    100
1    400
2    900
Name: a, dtype: int64

In [9]:
df['a'].apply(my_sq)

0    100
1    400
2    900
Name: a, dtype: int64

In [14]:
df['a'].apply(my_exp, n=2)

0    100
1    400
2    900
Name: a, dtype: int64

In [16]:
df['a'].apply(my_exp, n=3)

0     1000
1     8000
2    27000
Name: a, dtype: int64

In [18]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [19]:
def print_me(x):
    print(x)

In [22]:
print(df.apply(print_me, axis=1))

a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64
0    None
1    None
2    None
dtype: object

In [24]:
print(df.apply(print_me, axis=0))

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64
a    None
b    None
dtype: object

In [25]:
df['a']

0    10
1    20
2    30
Name: a, dtype: int64

In [26]:
def avg_3(x,y,z):
    return (x+y+z)/3

In [30]:
def avg_3_apply(col):
    x= col[0]
    y= col[1]
    z= col[2]
    return (x+y+z)/3

In [32]:
df.apply(avg_3_apply)

a    20.0
b    30.0
dtype: float64

In [40]:
df['a'][2]

30

In [41]:
def col_avg(col):
    sum = 0
    cnt = 0
    for item in col:
        sum += item
        cnt += 1
    return sum/cnt

In [46]:
df.apply(col_avg, axis=1)

0    15.0
1    25.0
2    35.0
dtype: float64

In [47]:
df.apply(col_avg, axis=0)

a    20.0
b    30.0
dtype: float64

In [48]:
import seaborn as sns

titanic = sns.load_dataset('titanic')

In [50]:
print(titanic.shape)
titanic.head()

(891, 15)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [51]:
print(titanic.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
survived       891 non-null int64
pclass         891 non-null int64
sex            891 non-null object
age            714 non-null float64
sibsp          891 non-null int64
parch          891 non-null int64
fare           891 non-null float64
embarked       889 non-null object
class          891 non-null category
who            891 non-null object
adult_male     891 non-null bool
deck           203 non-null category
embark_town    889 non-null object
alive          891 non-null object
alone          891 non-null bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB
None

In [72]:
prop = titanic['deck'].isnull().value_counts(normalize=True)*100
prop[0]

22.783389450056116

In [56]:
pd.isnull(titanic['deck']).sum()

688

In [75]:
def count_missing(vec):
    return pd.isnull(vec).sum()

In [58]:
titanic.apply(count_missing)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [63]:
titanic['deck'].shape[0]

891

In [79]:
def prop_missing(vec):
    prop = vec.isnull().value_counts(normalize=True)*100
    return 100-prop[0]

In [80]:
titanic.apply(prop_missing)

survived        0.000000
pclass          0.000000
sex             0.000000
age            19.865320
sibsp           0.000000
parch           0.000000
fare            0.000000
embarked        0.224467
class           0.000000
who             0.000000
adult_male      0.000000
deck           77.216611
embark_town     0.224467
alive           0.000000
alone           0.000000
dtype: float64

In [81]:
titanic['deck'].size

891

In [84]:
def prop_missing_book(vec):
    return count_missing(vec)/vec.size*100

In [85]:
titanic.apply(prop_missing_book)

survived        0.000000
pclass          0.000000
sex             0.000000
age            19.865320
sibsp           0.000000
parch           0.000000
fare            0.000000
embarked        0.224467
class           0.000000
who             0.000000
adult_male      0.000000
deck           77.216611
embark_town     0.224467
alive           0.000000
alone           0.000000
dtype: float64

In [88]:
def prop_complete(vec):
    return 100-prop_missing(vec)

In [89]:
titanic.apply(prop_complete)

survived       100.000000
pclass         100.000000
sex            100.000000
age             80.134680
sibsp          100.000000
parch          100.000000
fare           100.000000
embarked        99.775533
class          100.000000
who            100.000000
adult_male     100.000000
deck            22.783389
embark_town     99.775533
alive          100.000000
alone          100.000000
dtype: float64

In [93]:
cmis_row = titanic.apply(count_missing, axis=1)
pmis_row = titanic.apply(prop_missing, axis=1)
pcom_row = titanic.apply(prop_complete, axis=1)

In [94]:
titanic['num_missing'] = titanic.apply(count_missing, axis=1)
print(titanic.shape)
titanic.head()

(891, 16)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_missing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1

In [96]:
titanic['num_missing'].value_counts()

1    549
0    182
2    160
Name: num_missing, dtype: int64

In [97]:
titanic.loc[titanic['num_missing']>=2,:]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_missing
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True,2
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True,2
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True,2
26,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True,2
28,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True,2
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False,2
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True,2
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True,2
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,2